src/Web/JavaScript/javascript.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Javascript
#+OPTIONS: num:nil H:2

* Basics
+ [[https://developer.mozilla.org/en-US/docs/Web/JavaScript][Mozilla Developer Network]]
+ [[http://bonsaiden.github.io/JavaScript-Garden/][JavaScript Garden]] is a good reference to language quirks and gotchas.
+ [[http://eloquentjavascript.net/][Eloquent Javascript]] – free online book by Marijn Haverbeke
+ [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript?redirectlocale=en-US&redirectslug=JavaScript%2FA_re-introduction_to_JavaScript][A re-introduction to JavaScript (JS Tutorial)]] on Mozilla Developer Network
+ [[http://www.amazon.com/dp/0596517742][JavaScript: The Good Parts]] – Douglas Crockford (See also his [[http://yuiblog.com/crockford/][YUI videos]])
+ [[http://addyosmani.com/resources/essentialjsdesignpatterns/book/][Learning JavaScript Design Patterns]] by Addy Osmani
* Debugging
+ Learn to use [[http://jtaby.com/blog/2012/04/23/modern-web-development-part-1][the Webkit Inspector]] (or Firebug if use firefox)
+ use [[http://www.jshint.com/][JSHint]] to avoid syntactic bugs
* Style
+ [[https://plus.google.com/+AddyOsmani/posts/h37ZvatmKqV][Addy Osmani's list of good JavaScript style guide]]

* Javascript MVC
** Backbone.js- Simple MVC Backbone
+ [[http://addyosmani.github.io/backbone-fundamentals/][Backbone Fundamentals]]
** Angular.js - better but takes more time to learn
+ Start with [[http://egghead.io/][egghead.io]] and [[https://thinkster.io/][thinkster.io]]. 
+ Use [[http://yeoman.io/][yeoman]]
+ [[http://www.ng-newsletter.com/posts/angular-for-the-jquery-developer.html?utm_source=ng-newsletter&utm_campaign=5e1542e9ab-AngularJS_Newsletter_11_19_1311_18_2013&utm_medium=email&utm_term=0_fa61364f13-5e1542e9ab-93794813][Angular for jQuery developer]]
+ Make sure to have *AngularJS Batarang* in Chrome so you can debug
  scope.

* Lodash 
Javascript Library like [[https://github.com/lodash/lodash][Lodash]] (An arguably better fork of
[[http://underscorejs.org/][underscore]].) – make sure to use them only if you need. Sometimes d3
helpers are enough.

+ [[http://tech.pro/tutorial/1611/functional-javascript][a lodash tutorial]]

* database
+ [[https://github.com/StanfordHCI/datavore][datavore]] - A small, fast, in-browser database engine written in
  JavaScript.
+ [[http://square.github.io/crossfilter/][crossfilter]] -  a JavaScript library for exploring large multivariate
  datasets in the browser.

* Syntax alternatives
+ [[http://coffeescript.org/][CoffeeScript]] - is a little language that compiles into JavaScript.
+ [[http://www.typescriptlang.org/][TypeScript]] - is a typed superset of JavaScript that compiles to
  plain JavaScript.

