public_html/Web/JavaScript/javascript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Javascript</title>
<!-- 2015-01-13 Tue 22:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Javascript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Basics</a></li>
<li><a href="#sec-2">Debugging</a></li>
<li><a href="#sec-3">Style</a></li>
<li><a href="#sec-4">Javascript MVC</a>
<ul>
<li><a href="#sec-4-1">Backbone.js- Simple MVC Backbone</a></li>
<li><a href="#sec-4-2">Angular.js - better but takes more time to learn</a></li>
</ul>
</li>
<li><a href="#sec-5">Lodash</a></li>
<li><a href="#sec-6">database</a></li>
<li><a href="#sec-7">Syntax alternatives</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Basics</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">Mozilla Developer Network</a>
</li>
<li><a href="http://bonsaiden.github.io/JavaScript-Garden/">JavaScript Garden</a> is a good reference to language quirks and gotchas.
</li>
<li><a href="http://eloquentjavascript.net/">Eloquent Javascript</a> – free online book by Marijn Haverbeke
</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript?redirectlocale=en-US&redirectslug=JavaScript/A_re-introduction_to_JavaScript">A re-introduction to JavaScript (JS Tutorial)</a> on Mozilla Developer Network
</li>
<li><a href="http://www.amazon.com/dp/0596517742">JavaScript: The Good Parts</a> – Douglas Crockford (See also his <a href="http://yuiblog.com/crockford/">YUI videos</a>)
</li>
<li><a href="http://addyosmani.com/resources/essentialjsdesignpatterns/book/">Learning JavaScript Design Patterns</a> by Addy Osmani
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Debugging</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Learn to use <a href="http://jtaby.com/blog/2012/04/23/modern-web-development-part-1">the Webkit Inspector</a> (or Firebug if use firefox)
</li>
<li>use <a href="http://www.jshint.com/">JSHint</a> to avoid syntactic bugs
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Style</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://plus.google.com/+AddyOsmani/posts/h37ZvatmKqV">Addy Osmani's list of good JavaScript style guide</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Javascript MVC</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Backbone.js- Simple MVC Backbone</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="http://addyosmani.github.io/backbone-fundamentals/">Backbone Fundamentals</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Angular.js - better but takes more time to learn</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Start with <a href="http://egghead.io/">egghead.io</a> and <a href="https://thinkster.io/">thinkster.io</a>. 
</li>
<li>Use <a href="http://yeoman.io/">yeoman</a>
</li>
<li><a href="http://www.ng-newsletter.com/posts/angular-for-the-jquery-developer.html?utm_source=ng-newsletter&utm_campaign=5e1542e9ab-AngularJS_Newsletter_11_19_1311_18_2013&utm_medium=email&utm_term=0_fa61364f13-5e1542e9ab-93794813">Angular for jQuery developer</a>
</li>
<li>Make sure to have <b>AngularJS Batarang</b> in Chrome so you can debug
scope.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Lodash</h2>
<div class="outline-text-2" id="text-5">
<p>
Javascript Library like <a href="https://github.com/lodash/lodash">Lodash</a> (An arguably better fork of
<a href="http://underscorejs.org/">underscore</a>.) – make sure to use them only if you need. Sometimes d3
helpers are enough.
</p>

<ul class="org-ul">
<li><a href="http://tech.pro/tutorial/1611/functional-javascript">a lodash tutorial</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">database</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://github.com/StanfordHCI/datavore">datavore</a> - A small, fast, in-browser database engine written in
JavaScript.
</li>
<li><a href="http://square.github.io/crossfilter/">crossfilter</a> -  a JavaScript library for exploring large multivariate
datasets in the browser.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Syntax alternatives</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="http://coffeescript.org/">CoffeeScript</a> - is a little language that compiles into JavaScript.
</li>
<li><a href="http://www.typescriptlang.org/">TypeScript</a> - is a typed superset of JavaScript that compiles to
plain JavaScript.
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-01-13 Tue 22:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
